---
kind: property
id: P:Autodesk.Revit.DB.Reference.ElementId
source: html/909ec304-3c41-8319-4c80-efedce795d7f.htm
---
# Autodesk.Revit.DB.Reference.ElementId Property

The element id for this reference.

## Syntax (C#)
```csharp
public ElementId ElementId { get; }
```

## Remarks
InvalidElementId will be returned for references that don't refer to a particular element.